{
  "mainpage": {
    "banner": {
      "title": "Blockchain of tomorrow",
      "subtitle": "Enecuum is the first blockchain in the world to unite millions of smartphones into a single network.",
      "subscribeForm": {
        "description": "Please fill the subscription form to join ENQ. All important information about the project will be available to subscribed members.",
        "input": "Enter Your Email Address",
        "button": "Join"
      }
    },
    "features": [
      {
        "TITLE": "Scalability",
        "SUB_TITLE": "Directed Acyclic Hypergraph (HyperDAG)",
        "IMG": "img/mainpage/features/slider-img1.png",
        "TEXT": "New transaction recording method supporting creation of separate branches in the system, with a custom ruleset tailored to solve any business problem, including the problem of quick and cheap handling a large number of transactions. These branches made of chains of blocks each containing a number of homogenous transactions."
      },
      {
        "TITLE": "Scalability",
        "SUB_TITLE": "Free Transactions",
        "IMG": "img/mainpage/features/free.png",
        "TEXT": "Most part of transactions have zero fees. Our architecture already supports macroblocks of unlimited size - a unique solution allowing our system protocol to scale in parallel with the growing overall computational power of the network."
      },
      {
        "TITLE": "Speed",
        "SUB_TITLE": "High Speed",
        "IMG": "img/mainpage/features/speed.png",
        "TEXT": "High throughput allowing for up to 1 million transaction per second."
      },
      {
        "TITLE": "Security",
        "SUB_TITLE": "Hybrid Consensus Algorithm",
        "IMG": "img/mainpage/features/hammer.png",
        "TEXT": "Most blockchains use one of the three types of algorithms: Proof-of-Work (most secure, but slow), Proof-of-Stake (the cheapest, but not decentralized enough) and Proof-of-Activity (the fastest and the most decentralized). Enecuum combines the best features of all three algorithms in its own Hybrid Consensus Algorithm."
      },
      {
        "TITLE": "Security",
        "SUB_TITLE": "Private Branches",
        "IMG": "img/mainpage/features/cloud.png",
        "TEXT": "Enecuum Tickets allow to create dedicated branches where circulation of ENQ coins, the main system cryptocurrency, is not intended. A Ticket is both an access key to the corresponding branch and a decryption key for the transactions in this branch, and can be freely transferred between the users of the system. The key purpose of Ticket branches is to facilitate creation of a blockchain-based flexible environment for easy interaction between businesses and their customers."
      },
      {
        "TITLE": "Security",
        "SUB_TITLE": "Flexible Smart Contracts",
        "IMG": "img/mainpage/features/scheme.png",
        "TEXT": "SHARNELL linear logic + JS as the smart contract language. High level of Enecuum’s smart contracts security is ensured by the business-oriented linear logic called SHARNELL. They are written in JavaScript and are easy and cheap to implement for a web developer. A reliable and secure means to perform your own ICO and issue your own Tokens."
      },
      {
        "TITLE": "Security",
        "SUB_TITLE": "On-chain Voting",
        "IMG": "img/mainpage/features/scheme2.png",
        "TEXT": "On-chain voting + test branch for a safe upgrade of the system. Support of various branches allows to create private branches with custom rulesets adapted to a particular business case."
      }
    ],
    "businesscase": {
      "title": "Business Cases",
      "slider": [
        {
          "TITLE": "ICO Platform",
          "BAR": "ICO Platform",
          "IMG": "img/mainpage/business/ico.png",
          "TEXT": {
            "BLOCK_1": "High throughput of the Enecuum blockchain enables startups to raise funds at any scale, without the risk of a network hang-up. This way all the investors can be sure they can participate in the ICO and quickly receive their Tokens.",
            "BLOCK_2": "Smart contracts in Enecuum are implemented in JavaScript and are easy to write for a web developer. It significantly decreases the learning curve and cost of their creation. Linear logic at their base helps eliminate potential vulnerabilities in smart contracts and minimizes the risks of hacking.",
            "BLOCK_3": "“Cancellation model” allows to implement complex crowdsales with step-by-step raising and return of the funds to the investors, at any stage of the process. System-specific notation of Tokens, similar to the ERC-20 notation, simplifies their entry to a cryptocurrency exchange service after the ICO."
          }
        },
        {
          "TITLE": "Banking, Corporate & Insurance",
          "BAR": "Banking",
          "IMG": "img/mainpage/business/bank.png",
          "TEXT": {
            "BLOCK_1": "Enecuum’s Tickets and Marks aim to provide banks and government agencies with a reliable control over targeted spending of received credit and budget funds, and companies to conduct secure payments between themselves with no fear of sensitive information or trade secrets disclosure.",
            "BLOCK_2": "Tickets intend to give banks a secure channel of communication when sharing a Ticket with Bank B, Bank A could give Bank B access to a private branch only holders of this Ticket could access to and only holders of this Ticket could decrypt transaction from.",
            "BLOCK_3": "Another example could be when Bank A assings different Marks to its customersbased based on the nature of their business (construction company, industrial equipment supplier, etc). Bank A could then issue a client a directed loan in Tokens having a specific Mark. The client could only use these Tokens to pay certain predefined organizations, spending them according to the purpose of the loan."
          }
        },
        {
          "TITLE": "Distributed Computations",
          "BAR": "Computations",
          "IMG": "img/mainpage/business/analysis.png",
          "TEXT": {
            "BLOCK_1": "System ability to run “heavy” smart contracts in dedicated branches allows users to perform complex calculations that require high computational power without increasing workload on the main Enecuum branches (useful for neural network training, scientific calculations, rendering computer graphics, JS libraries and so on).",
            "BLOCK_2": "Payment for using such “heavy” smart contracts is performed in ENQ coins at a flexible rate, similar to the transaction price concept in the Ethereum blockchain. Creating a request to perform the calculations, the customer sets the price and miners decide whether it is beneficial for them to provide their computational power for the task.",
            "BLOCK_3": "In case miners agree to the terms, the customer’s funds are reserved by the smart contract for future payment. When the task is completed and valid results are provided, the funds are released and automatically transferred to the miners."
          }
        },
        {
          "TITLE": "Decentralized Storage",
          "BAR": "Storage",
          "IMG": "img/mainpage/business/store.png",
          "TEXT": {
            "BLOCK_1": "Effective use of disk space on user’s devices achieved through sharding and change of the transaction duplication parameters.",
            "BLOCK_2": "For example, if 4 users provide 5 GB of space each and the duplication and sharding parameters set to 50%, the effective storage capacity for files is 10 GB. Extrapolating this pattern to the entire network, the size of the “global decentralized disk” will grow proportionally preserving availability of the data and a sufficiently high speed of access. That means users can build on top of the Enecuum blockchain such services as decentralized hostings, cloud data storage services and content delivery networks.",
            "BLOCK_3": "Applying SHARNELL Smart Contracts, and Tickets as encryption keys on top of such data branches, users can create complex paid access services with decentralized and immutable content paid for in Tokens."
          }
        },
        {
          "TITLE": "Micropayments, Fintech & IoT",
          "BAR": "Micropayments",
          "IMG": "img/mainpage/business/pay.png",
          "TEXT": {
            "BLOCK_1": "Support of separate branches with their own consensus rulesets that stimulates miners’ activity creates conditions beneficial for implementation of micro-transaction services.",
            "BLOCK_2": "Zero transaction fee for a decentralized micro-transaction service. Extremely low fee per transaction in case of a centralization when a service makes a lot of micro-transactions from a single wallet. For example, 10,000,000 transactions a day can be easily recorded in several large macroblocks of ~120 MB each. The fee will be calculated per block, and will be very low per transaction.",
            "BLOCK_3": "This is a perfect case for an Internet of Things-based service. A simple PoA mining client running on various devices will be able to completely cover their carried transaction fees. A mesh network, supported by the Enecuum protocol, between these devices provides a high availability."
          }
        }
      ]
    },
    "mining": {
      "title": "Mining",
      "subtitle": "Hybrid Consensus Algorithm",
      "blocks": {
        "title": "3 Mining Stages",
        "stages": [
          {
            "TITLE": "Proof-of-Work",
            "IMG": "img/mainpage/mining/hammer.png",
            "TEXT": {
              "BLOCK_1": "Proof of Work at Enecuum is based on an improved version of the Bitcoin-NG protocol modified for effective mining of many block of different types in parallel. This approach ensures high scalability the system.",
              "BLOCK_2": "A custom version of the Cryptonight protocol (Keccak + AES + X11) aims to defend the system against centralization caused by Application-Specific Integrated Circuit devices.",
              "BLOCK_3": "PoW miners calculate the block hash and hold their macroblocks open for PoA miners to fill it with microblocks containing transactions."
            }
          },
          {
            "TITLE": "Proof-of-Activity",
            "IMG": "img/mainpage/mining/hammers.png",
            "TEXT": {
              "BLOCK_1": "Proof of Activity at Eneecum is proposed to be applied at two different stages.",
              "BLOCK_2": " First, PoA miners reach consensus to form teams of 64 participants. Second, every team validates a chain of 62 microblocks with 40 transaction each and publish them into the network - to the blocks opened by the PoW miners.",
              "BLOCK_3": "PoA mining at Enecuum requires a wide and steady Internet connection, but low computational power and can be performed on mobile devices."
            }
          },
          {
            "TITLE": "Proof-of-Stake",
            "IMG": "img/mainpage/mining/safety.png",
            "TEXT": {
              "BLOCK_1": "PoS miners continuously re-check balances of all wallets in the system.",
              "BLOCK_2": "The reward for PoS mining is flexible. The system defines the minimum and maximum balance thresholds outside of which a miner is not able to gain any reward."
            }
          }
        ]
      }
    },
    "phonemining": {
      "title": "Phone mining",
      "img": "img/mainpage/phone_mining/phone--en.png",
      "list": [
        {
          "title": "Phone mining",
          "description": "Every smartphone on the network will participate in the publication of microblocks on a daily basis and receive a reward for this. This opens doors of the crypto world to millions of new users. A user simply needs to download the Enecuum App, which places a light processing load on the smartphone - comparable to a traditional messenger app. "
        },
        {
          "title": "Decentralization",
          "description": "Millions of smartphones around the world connect to the Enecuum network creating a truly decentralized system. Any file is stored on a multitude of devices, which makes the whole system exceptionally secure."
        },
        {
          "title": "Proof-of-Activity node",
          "description": "On average, people only use about 10% of data processing capabilities of their smartphones. Enecuum leases this unused capacity and in return rewards the device owner. The smartphone becomes a part of a huge network, with a special algorithm using the capacity of each device in the most effective way. This algorithm is called Proof-of-Activity."
        }
      ]
    },
    "breakthroughtech": {
      "title": "Breakthrough technology",
      "img": "img/mainpage/phone_mining/phone--en.png",
      "wp": "Download whitepaper",
      "wp_ko": "백서",
      "onepager": "Onepager",
      "list": [
        {
          "title": "Breakthrough technology",
          "description": "Enecuum is the first blockchain enterprise to combine PoW, PoA, and PoS technologies in the blockchain of the future, providing unlimited speed, unlimited scalability, maximum decentralization, and security. In addition, Enecuum supports smart contracts written in the most accessible and popular JavaScript language. This makes Enecuum a great way for companies to expand their business."
        },
        {
          "title": "HyperDAG",
          "description": "Just imagine that a chef in a restaurant has to cook each meal separately by himself, one after another. The waiting time will destroy the business very soon. The one and only solution is to cook all parts of the dishes simultaneously. Additionally, a lot of visitors make partially identical orders that can be prepared simultaneously, thus speeding up the service."
        },
        {
          "title": "Hybrid consensus algorithm ",
          "description": "Most blockchains use one of three types of algorithms: Proof-of-Work (this one is the most secure, but is slow), Proof-of-Stake (the cheapest, but not decentralized enough) and Proof-of-Activity (the fastest and most decentralized). Enecuum took the best of all three algorithms in creating its own Hybrid Consensus Algorithm.\nOur HyperDAG technology serves the same purpose, allowing the conducting of many parallel tasks which are simultaneously solved by the network of millions of smartphones. The bigger the number of smartphones in the network is, the quicker these tasks will be resolved. This technology really makes Enecuum one-of-a-kind blockchain project."
        },
        {
          "title": "SHARDING",
          "description": "Personal data of millions of people is stored on the Internet. Hackers gain access to bank accounts or personal files of many people so easily because these files are stored on a single server. If access to such a server is compromised, all files on it are accessible to any unauthorized user.\nThis problem can be solved only by storing personal data in decentralized systems.\nImagine that your photo is torn into 1,000 pieces, and each piece is stored separately. Only you can put them back together because you have a unique key, which tells you how and where to collect and reassemble this 1000-piece puzzle. Even if the hackers are able to steal pieces from multiple devices, they would not be able to reassemble the file without your key.\nEach of the pieces is duplicated several times on different devices, so you can access your photo at any time from anywhere in the world even if some of the pieces get lost. It has become possible with a decentralized system and the technology called Sharding."
        },
        {
          "title": "SHARNELL smart contracts",
          "description": "Smart Contract technology allows you to enter into secure business relations between two or more parties around the world instantly, and without the involvement of expensive contract lawyers.\nWhy is it called \"smart\"? Until recently, you’ve had to draw up a contract, obtain signatures from all interested parties, and then wait several days for payment clearance for concluding a deal. All these processes required a lot of time and significant resources. With the introduction of the electronic signature, the process became somewhat faster, but the red tape and the human factor still mean a lot.\nLet's imagine that you live in Germany and would like to purchase 10 tons of bananas from Brazil. Normally you would need to find a supplier, sign a contract with him, wait for him to find and purchase bananas for you, control logistics, etc. Each stage of the process would have required a separate agreement needed to be finalized by all parties. At the same time, at every stage, there would exist a risk of fraud by any counterparty.\nEverything is much simpler and safer with a smart contract. The system will automatically transfer money throughout the supplier chain at the time of the transaction. It is impossible to deceive the contractor in this situation since all data is contained in the blockchain and any transaction can be checked on request.\nSmart contracts are no longer the land of lawyers but of programmers. However, the programming languages of different blockchains are still quite new, and the development community is small. Because of this, development costs of smart contracts are usually very high, and the quality of the code is lower than expected.\nEnecuum solved this problem by using a variation of linear logic called SHARNELL to write smart contracts. One of its key features is that it simply will not allow the execution of a smart contract in case of an error. In addition, the main language for creating smart contracts in Enecuum will be the most common programming language in the world — JavaScript, allowing not only faster developing of contracts, but also substantial development cost savings."
        }
      ]
    },
    "changingworld": {
      "title": "Changing the world",
      "img": "img/mainpage/phone_mining/phone--en.png",
      "list": [
        [
          {
            "title": "Changing the world",
            "description": "Enecuum is an ideal platform for companies that need a fast, secure, and decentralized blockchain. We have created a technology that can radically ease various areas of life and business: from providing free mobile communication for subscribers to putting scientific breakthroughs within reach with unlimited computing capacity."
          },
          {
            "title": "Science",
            "description": "The computing power of Enecuum can be used to solve complex scientific problems with results available to any scientific community anywhere."
          },
          {
            "title": "Government",
            "description": "Enecuum facilitates voting of any degree of complexity, and its results cannot be falsified. Experimental elections using blockchain technology have proved to be successful. Government bodies will now have the opportunity to store citizens’ personal data safely, as well as to implement fully electronic document management, making public services clear and more accessible to the population."
          },
          {
            "title": "Education",
            "description": "Fake diplomas, certificates, and even fake academic degrees are still a problem for the scientific community. Enecuum will guarantee transparency and authenticity of such documents making sure they cannot be rewritten or partially modified. Records will be stored in a decentralized network and will be accessible to everyone from anywhere in the world."
          },
          {
            "title": "Logistic",
            "description": "Enecuum technology allows you to manage the delivery of goods around the world easily and safely. Logistics has never been more easier and more convenient."
          }
        ],
        [
          {
            "title": "Energy",
            "description": "Each customer will only pay for the amount of electricity that they consumed. Through our SHARNELL Smart Contracts, Enecuum will allow companies to generate perfectly accurate invoices for each meter."
          },
          {
            "title": "IT Development",
            "description": "Thanks to Enecuum, developers gain the opportunity to implement complex applications without having to worry about the capacity of their physical servers."
          },
          {
            "title": "Telecom",
            "description": "Enecuum opens new horizons for the Telecom sector with free mobile communication for subscribers and thousands of new customers for mobile operators. For the first time in history, smartphones will generate passive income for their owners."
          },
          {
            "title": "Medicine",
            "description": "You will now be able to fulfill your prescription from Argentina while on vacation in Italy. Enecuum makes it possible with a decentralized storage network for health records. This kind of global access has never existed before due to technical limitations. We are close to removing these limitations forever."
          },
          {
            "title": "Insurance",
            "description": "Personal calculations of insurance policies can now be offered with full transparency and within a cheat-proof system. Our technology will reduce the cost of insurance for the client while protecting insurance companies from fraudsters."
          }
        ]
      ]
    },
    "blockchain": {
      "title": "Blockchain of tomorrow",
      "description": "Enecuum allows each smartphone owner to participate in a global network and get rewarded for it. Crypto technologies should not belong to a small community of technological elite. On the contrary, everyone should have the opportunity to become a part of a beautiful future. We make access to this advanced technology simple and easy. This is what the Blockchain of Tomorrow should be.",
      "img": "img/mainpage/phone_mining/phone--en.png"
    },
    "roadmap": {
      "title": "Roadmap",
      "img_desctop": "img/mainpage/roadmap/road_map_desktop.png",
      "img_mobile": "img/mainpage/roadmap/road_map_mobile.png",
      "list": [
        {
          "date": "2015",
          "text": "Launch the project. Analyse existing blockchains for critical problems and ways to solve them."
        },
        {
          "date": "2017",
          "text": "Assemble the core development team."
        },
        {
          "date": "q1 2018",
          "text": "Implement the network protocol, RPC API, wallets."
        },
        {
          "date": "q2 2018",
          "text": "Implement PoW and PoA."
        },
        {
          "date": "q3 2018",
          "text": "Launch the TestNet. Implement PoS."
        },
        {
          "date": "q4 2018",
          "text": "Implement Smart Contracts on Petri Nets and start working on SHARNELL Smart Contracts."
        },
        {
          "date": "q1 2019",
          "text": "Create a gateway for automatic transfer of smart contracts from other systems to Enecuum."
        },
        {
          "date": "q2 2019",
          "text": "Continuously improve the protocol."
        }
      ]
    },
    "partners": [
      {
        "title": "Partners ",
        "items": [
          {
            "text": "AlphaChain specializes in platform and protocol level projects that will eventually form the foundation of the new internet of value.",
            "img": "img/mainpage/partners/alphachain.png"
          },
          {
            "text": "Team of investment professionals with more than $400m in assets under management.",
            "img": "img/mainpage/partners/GEM_Crypto_black.png"
          },
          {
            "text": "A consortium of the industry’s leading advisors and influencers scaling world-class blockchain projects with a focus on exchanges, protocols and infrastructure.",
            "img": "img/mainpage/partners/coinsortium.png"
          },
          {
            "text": "Home of Blockchain Opportunities",
            "img": "img/mainpage/partners/iCapital.png"
          }
        ]
      },
      {
        "title": "Ecosystem and business partners",
        "items": [
          {
            "text": "Mikado's Mission is to improve and standardize the blockchain industry by importing proven practices from the traditional capital market.",
            "img": "img/mainpage/partners/mikado.png"
          },
          {
            "text": "Offline mobile blockchain with banks partnership and crypto-fiat license",
            "img": "img/mainpage/partners/plasmapay.png"
          },
          {
            "text": "Site for the search for teachers.",
            "img": "img/mainpage/partners/upstudy.png"
          }
        ]
      },
      {
        "title": "Legal Advisor",
        "items": [
          {
            "text": "Recognised as one of the world’s most innovative law firms, King & Wood Mallesons offers a different perspective to commercial thinking and the client experience.",
            "img": "img/mainpage/partners/king-wood-malleson.png"
          }
        ]
      },
      {
        "title": "We are member of fintech association of Hong Kong",
        "items": [
          {
            "text": "Independent non-for-profit membership based association representing Hong Kong’s local and global FinTech community.",
            "img": "img/mainpage/partners/fintechhh.png"
          }
        ]
      }
    ],
    "feedback": {
      "title": "Contact Us",
      "button": "Send"
    }
  }
}
